hw_06/solution/README.md
```mermaid
C4Context
    title Контекст системы бронирования билетов на мероприятия
        Enterprise_Boundary(b0, "") {
        Person(personUser, "Покупатель", "Покупатель билетов.<br/>Пользователь, ищущий и покупающий билеты.")
        Person(personOrganizer, "Организатор", "Организатор мероприятий.<br/>Добавляет мероприятия и управляет залами.")
        Person(personController, "Контролер", "Контролер билетов.<br/>Проверяет и валидирует билеты на входе.")
        Person(personAdministrator, "Администратор", "Администратор системы<br/>Сотрудник Tiketing System, настраивает лимиты и решает споры.")

        System(systemTicketingSystem, "Tiketing System", "Платформа бронирования билетов.<br/>'Позволяет искать мероприятия, безопасно покупать билеты без риска двойных продаж и валидировать их на входе.")
        }

        Boundary(b1, "") {
        System_Ext(extSystemPayment, "Payment Provider", "Инициирует списание средств и возвраты клиентам.")
        System_Ext(extSystemIdentity, "Identity Provider", "Внешний сервис авторизации. Yandex, Google, Facebook, etc...")
        System_Ext(extSystemNotification, "Notification Provider", "Передает Email / SMS / Push сообщения с электронными билетами для доставки.")
        }      

        Rel(personUser, systemTicketingSystem, "Ищет концерты,<br/>резервирует места,<br/> оплачивает заказы.")
        Rel(personOrganizer, systemTicketingSystem, "Заводит мероприятия,<br/> настраивает схемы залов.")
        Rel(personController, systemTicketingSystem, "Сканирует QR-коды<br/> для проверки<br/> статуса билета.")
        Rel(personAdministrator, systemTicketingSystem, "Модерирует события,<br/>меняет лимиты,<br/> разрешает спорные ситуации.")

        Rel(systemTicketingSystem, extSystemPayment, "Списание и возвраты<br/>средств клиента.")
        Rel(systemTicketingSystem, extSystemIdentity, "Внешний сервис авторизации.")
        Rel(systemTicketingSystem, extSystemNotification, "Передает Email / SMS / Push<br/>сообщения с электронными билетами для доставки.")

        UpdateLayoutConfig($c4ShapeInRow="4", $c4BoundaryInRow="1")
       
```
